sizeofvoid/openbsdisks2/bsdisks.conf.5
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2020 Pau Amma <pauamma@gundo.com>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 3, 2020
.Dt BSDISKS.CONF 5
.Os
.Sh NAME
.Nm bsdisks.conf
.Nd "configuration file for the bsdisks utility"
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
Lines in
.Nm
are limited to 1024 characters.
Lines where the first non-blank character is a # are comments and are
ignored.
Non-comment lines are of the form
.Ar name
=
.Ar value ,
where
.Ar name
can be:
.Bl -tag -width indent
.It mount_msdosfs_flags
Space-separated arguments to be passed to
.Xr mount_msdosfs 8 .
.El
.Sh SEE ALSO
.Xr bsdisks 8
.Sh HISTORY
This manual page was written for version 0.17 of the
.Nm bsdisks
utility.
.Sh AUTHORS
.An Gleb Popov Aq Mt arrowd@freebsd.org
wrote the
.Nm bsdisks
utility, and
.An Pau Amma Aq Mt pauamma@gundo.com
wrote this manual page.
